+++
title = "Perceptron"
categories = ["supervised-learning"]
tags = ["classification", "neurons", "linear", "binary"]
toc = "true"
math = "true"
+++

** Example 1
We can step through a small example manually too:

Given the following data, we wish to create a classifier that successfully separates the data. We can then do our own inferences when given a new point such as \((5,2)\) for example.

|---------+----+----+-------|
| example | x1 | x2 | class |
|---------+----+----+-------|
| a.      |  0 |  1 |    -1 |
| b.      |  2 |  0 |    -1 |
| c.      |  1 |  1 |    +1 |
|---------+----+----+-------|

Now of course a purely geometric solution can be constructed for this, and we can spin one up in a moment to match our arithmetic with; but first let us update the weights manually and see how many iterations of this algorithm are required to find such a solution.

#+BEGIN_SRC jupyter-python :session weird :tangle yes
  import numpy as np

  #data; note the 1's forming the bias component of our model
  a = np.array([1,0,1,-1])
  b = np.array([1,2,0,-1])
  c = np.array([1,1,1,+1])
  X = np.array([a,b,c]) # design matrix
  eta = 1.0

  #w = np.array([-1.5, 0, 2])
  w = np.zeros(3)

  errors = len(w)
  while errors > 0:
    errors = len(w)
    for x in X:
      # calculate s
      s = x[0] * w[0] + x[1] * w[1] + x[2] * w[2]
      if (s * x[3] > 0): # checks that sign is the same.
	errors -= 1
      else: # updates weight vector.
	if s > 0: #subtract
	  w = np.array([j-eta*x[i] for i,j in enumerate(w)])
	else: # add
	  w = np.array([j+eta*x[i] for i,j in enumerate(w)])
      print(w)
#+END_SRC

#+begin_example
[1. 0. 1.]
[ 0. -2.  1.]
[ 1. -1.  2.]
[ 0. -1.  1.]
[ 0. -1.  1.]
[1. 0. 2.]
[0. 0. 1.]
[1. 2. 1.]
[1. 2. 1.]
[0. 2. 0.]
[0. 3. 2.]
[-1.  1.  2.]
[-1.  1.  2.]
[-2.  1.  1.]
[-1.  3.  1.]
[-1.  3.  1.]
[0. 3. 2.]
[-1.  1.  2.]
[-1.  1.  2.]
[-2.  1.  1.]
[-1.  3.  1.]
[-1.  3.  1.]
...
another [0. 3. 2.] block ...
#+end_example

The above results are very informative, and rather unexpected. We learn a couple of things:
1. The Perceptron Algorithm does not always converge to the optimal solution.
   - We already knew it would not find a solution to a non-linear problem, but this problem /is/ linear; what gives?
   - In fact, the reason why it does not converge in this case is because *we chose bad initialisation weights*!
2. My code above differs from the algorithm figure you saw above:
   - I calculate \(s\), a useful auxillary value and then do comparisons on that variable.
   - This was the code I wrote during my semester to solve a tutorial problem. The only difference was that I was given different initialisation weights as such:

#+BEGIN_SRC jupyter-python :session new
  w = np.array([-1.5, 0, 2])
#+END_SRC

#+RESULTS:
#+begin_example
  [-2.5  0.   1. ]
  [-2.5  0.   1. ]
  [-1.5  1.   2. ]
  [-2.5  1.   1. ]
  [-2.5  1.   1. ]
  [-1.5  2.   2. ]
  [-2.5  2.   1. ]
  [-3.5  0.   1. ]
  [-2.5  1.   2. ]
  [-2.5  1.   2. ]
  [-2.5  1.   2. ]
  [-2.5  1.   2. ]
#+end_example

It appears that the more asymmetric starting vector facilitates converges in just 12 steps!

*** Method Extraction:
At this point, we keep reusing the same code and so let us refactor the rogue perceptron code into a more disciplined class:

#+BEGIN_SRC jupyter-python :session new
  class Perceptron:
    def __init__(self, eta=1.0, max_iter=100):
      self.eta = eta
      self.max_iter = max_iter
      self.weights = None

    def fit(self, X):
      #self.weights = np.zeros(X.shape[1]-1) #initialise weight to 0's
      #self.weights = np.array([-1.5,0,2])
      self.weights = np.array([5.0,1.0,1.0])
      num_samples = X.shape[0]
      iteration = 0

      while iteration < self.max_iter:
	errors = 0
	for sample in X:
          bias, x1, x2, y = sample
          s = np.dot(self.weights, [bias, x1, x2])

          if s * y <= 0:
            errors += 1
            update = self.eta * y * np.array([bias, x1, x2])
            self.weights += update

	print(f"Epoch {iteration}: Weights={self.weights}")
	if errors == 0:
          break #converged!
	iteration += 1
      if iteration == self.max_iter:
	print("Reached maximum iterations without convergence.")


    def predict(self, X):
      if self.weights is None:
	raise ValueError("Model not trained yet. Call fit method first!")
      X_with_bias = np.hstack((np.ones((X.shape[0],1)),X))
      return np.sign(X_with_bias @ self.weights)
#+END_SRC

#+RESULTS:

We can quickly sanity test on our inputs from our last perceptron:
#+BEGIN_SRC jupyter-python :session new
  p = Perceptron()
  p.fit(X)
  print(f"weights: {p.weights}")
#+END_SRC

#+RESULTS:
: Epoch 0: Weights=[-0.5  2.   1. ]
: Epoch 1: Weights=[-0.5  2.   1. ]
: weights: [-0.5  2.   1. ]

*** Solving Table 2:
#+BEGIN_SRC jupyter-python :session new
  a = np.array([1, -2, -1, -1])
  b = np.array([1,  2, -1, +1])
  c = np.array([1,  1,  1, +1])
  d = np.array([1, -1, -1, -1])
  e = np.array([1,  3,  2, +1])
  big_X = np.array([a,b,c,d,e])
  big_p = Perceptron()
  big_p.fit(big_X)
  print(f"weights: {big_p.weights}")
#+END_SRC

#+RESULTS:
: Epoch 0: Weights=[4. 3. 2.]
: Epoch 1: Weights=[4. 3. 2.]
: weights: [4. 3. 2.]

**** Discrepancies:
Observe now that a different learning rate \(\eta\) yields us a different line:
#+BEGIN_SRC jupyter-python :session new
  big_p_new_eta = Perceptron(eta=0.4)
  big_p_new_eta.fit(big_X)
  print(f"weights: {big_p_new_eta.weights}")
#+END_SRC

#+RESULTS:
: Epoch 0: Weights=[4.2 2.2 1.8]
: Epoch 1: Weights=[3.8 2.6 2.2]
: Epoch 2: Weights=[3.8 2.6 2.2]
: weights: [3.8 2.6 2.2]

